//จงเขียนโปรแกรมคำนวณเกรดเฉลี่ยของตนเองในปีการศึกษานี้ทั้งหมด โดยนักศึกษาจะรับข้อมูล ชื่อวิชา หน่วยกิต เกรดที่ได้ แล้วโปรแกรมจะแสดงผลลัพธ์เป็นตารางสรุปเกรดวิชาต่างๆ พร้อมแสดงผลเกรดเฉลี่ยของนักศึกษา (Level 3)
#include <stdio.h>
//จงเขียนโปรแกรมรับตัวเลข 1 ตัวแล้วให้คอมพิวเตอร์วาดรูปเครื่องหมาย * เป็นรูปผีเสื้อที่มีขนาดของปีกแต่ละข้างเท่ากับตัวเลขที่รับเข้ามา ดังตัวอย่าง (Level 3)
//วิธีที่ 1

int main ()
{
    int s;
    printf("Enter:");
    scanf("%d",&s);
    for (int i = 1; i <= s ; i++)
    {
        for (int j = 1; j <= s*2-1; j++)
        {
            if (j<=i || j>=s*2-i)
            {
                printf("* ");
            }
            else
                printf("  ");
        }
        printf("\n");
    }
    for ( int i = s-1; i >=1 ; i--)
    {
        for (int j = 1; j <= s*2-1; j++)
        {
            if (j<=i || j>=s*2-i)
            {
                printf("* ");
            }
            else
            printf("  ");
        }
        printf("\n");
    }
}